coreutils
ctags
git
gnupg2
haskell-platform
htop
hub
legit
mercurial
moreutils
pypy
python
python3
reattach-to-user-namespace
ssh-copy-id
the_silver_searcher
tig
tmux
weechat
zsh
