# brew bundle to install all

tap "caskroom/fonts"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Reimplementation of ctags(1)
brew "ctags"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Load/unload environment variables based on $PWD
brew "direnv"
# More intuitive version of du in rust
brew "dust"
# Modern replacement for 'ls'
brew "exa"
# Command-line tool to interact with exercism.io
brew "exercism"
# CLI tool for quick access to files and directories
brew "fasd"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Make JSON greppable
brew "gron"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interpreted, interactive, object-oriented programming language
brew "python3"
# Interpreted, interactive, object-oriented programming language
brew "python2"
# GUI for vim, made for macOS
brew "neovim"
# Platform built on V8 to build network applications
brew "pv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# The Rust toolchain installer
brew "rustup-init"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"


cask "vimr"
cask "iterm2"
cask "caskroom/fonts/font-iosevka"
cask "caskroom/fonts/font-fira-code"
cask "caskroom/fonts/font-input"
cask "caskroom/fonts/font-source-code-pro"
cask "caskroom/fonts/font-monoid"
cask "caskroom/fonts/font-ubuntu"
cask "caskroom/fonts/font-sudo"
